Repository: Anonymous747/chess_rps
Catalog: flutter_app/lib/l10n/app_*.arb
Languages: ru

# appName
source: Chess Arena
ru: Шахматная Арена

source: Settings
ru: Настройки

source: Language
ru: Язык

source: English
ru: Английский

source: Russian
ru: Русский

source: ACCOUNT
ru: АККАУНТ

source: GAMEPLAY
ru: ИГРОВОЙ ПРОЦЕСС

# audioAndSync
source: AUDIO & SYNC
ru: АУДИО И СИНХРОНИЗАЦИЯ

source: PRIVACY
ru: ПРИВАТНОСТЬ

source: Board Theme
ru: Тема доски

source: Piece Set
ru: Набор фигур

source: Auto-Queen
ru: Автоматический ферзь

# autoQueenDescription
source: Automatically promote to Queen
ru: Автоматически повышать до ферзя

source: Confirm Moves
ru: Подтверждать ходы

source: Master Volume
ru: Главная громкость

source: Push Notifications
ru: Push-уведомления

source: Privacy Policy
ru: Политика конфиденциальности

source: Online Status
ru: Статус онлайн

# onlineStatusDescription
source: Visible to friends only
ru: Видно только друзьям

source: Log Out
ru: Выйти

source: Edit Profile
ru: Редактировать профиль

source: Membership
ru: Членство

source: GENERAL
ru: ОБЩЕЕ

source: Grandmaster
ru: Гроссмейстер

# ratingPosition
source: Rating Position: #{position}
ru: Позиция в рейтинге: #{position}

source: Error loading settings
ru: Ошибка загрузки настроек

source: Error loading language settings
ru: Ошибка загрузки языковых настроек

source: Cancel
ru: Отмена

# appVersion
source: Chess Arena v2.4.1 (Build 890)
ru: Шахматная Арена v2.4.1 (Сборка 890)

source: Home
ru: Главная

source: Events
ru: События

source: Chat
ru: Чат

source: Profile
ru: Профиль

source: Rating
ru: Рейтинг

source: Collection
ru: Коллекция

source: Friends
ru: Друзья

# skinsAndBoards
source: Skins & Boards
ru: Скины и доски

source: Online
ru: Онлайн

source: Preferences
ru: Настройки

source: Variation Games
ru: Вариативные игры

# variationGamesDescription
source: RPS, Blitz, Bullet & Chaos Modes
ru: КНБ, Блиц, Буллет и Хаос режимы

source: Tournament Games
ru: Турнирные игры

# tournamentGamesDescription
source: Compete in daily events and win exclusive skins.
ru: Участвуйте в ежедневных событиях и выигрывайте эксклюзивные скины.

source: FEATURED
ru: РЕКОМЕНДУЕМОЕ

source: • LIVE
ru: • В ЭФИРЕ

# level
source: Level {level}
ru: Уровень {level}

source: Novice
ru: Новичок

source: Chess RPS
ru: Шахматы КНБ

source: Select Game Mode
ru: Выберите режим игры

source: Classical Mode
ru: Классический режим

source: RPS Mode
ru: Режим КНБ

source: Select Opponent
ru: Выберите соперника

# chooseOpponentDescription
source: Choose who you want to play with
ru: Выберите, с кем хотите играть

source: Play with AI
ru: Играть с ИИ

source: Coming Soon
ru: Скоро...

source: Play Online
ru: Играть онлайн

# failedToFindMatch
source: Failed to find match: {error}
ru: Не удалось найти матч: {error}

# youWonRps
source: You won RPS! Make your move
ru: Вы выиграли КНБ! Сделайте ход

# opponentWonRps
source: Opponent won RPS. Waiting...
ru: Соперник выиграл КНБ. Ожидание...

source: Draw!
ru: Ничья!

source: Victory!
ru: Победа!

source: Defeat
ru: Поражение

# stalemateMessage
source: The game ended in a stalemate. Neither player wins.
ru: Игра закончилась патом. Никто не выиграл.

# drawMessage
source: The game ended in a draw.
ru: Игра закончилась вничью.

# checkmateWin
source: Congratulations! You won by checkmate!
ru: Поздравляем! Вы выиграли матом!

# winMessage
source: Congratulations! You won!
ru: Поздравляем! Вы выиграли!

# checkmateLoss
source: You were checkmated. Better luck next time!
ru: Вам поставили мат. Удачи в следующий раз!

# lossMessage
source: You lost the game. Better luck next time!
ru: Вы проиграли игру. Удачи в следующий раз!

source: Experience
ru: Опыт

# xpGained
source: +{xp} XP
ru: +{xp} ОП

source: Return to Menu
ru: Вернуться в меню

source: Finish Game?
ru: Завершить игру?

source: Warning
ru: Предупреждение

# finishGameWarning
source: Are you sure you want to finish this game? Your progress will be lost.
ru: Вы уверены, что хотите завершить эту игру? Ваш прогресс будет потерян.

source: Finish
ru: Завершить

source: Choose Your Side
ru: Выберите свою сторону

# whiteMovesFirst
source: White always moves first
ru: Белые всегда ходят первыми

source: White
ru: Белые

source: Black
ru: Черные

source: Randomize
ru: Случайно

source: Moves First
ru: Ходит первым

source: AI Moves First
ru: ИИ ходит первым

source: Select Difficulty
ru: Выберите сложность

# chooseAIDifficulty
source: Choose the AI difficulty level
ru: Выберите уровень сложности ИИ

source: Beginner
ru: Новичок

# beginnerDescription
source: Perfect for learning the basics
ru: Идеально для изучения основ

source: Easy
ru: Легко

# easyDescription
source: A gentle challenge
ru: Мягкий вызов

source: Medium
ru: Средне

# mediumDescription
source: A balanced opponent
ru: Сбалансированный соперник

source: Hard
ru: Сложно

# hardDescription
source: A tough challenge
ru: Серьезный вызов

source: Expert
ru: Эксперт

# expertDescription
source: Maximum difficulty
ru: Максимальная сложность

source: Welcome Back
ru: С возвращением

source: Sign in to continue
ru: Войдите, чтобы продолжить

source: Phone Number
ru: Номер телефона

# enterPhoneNumber
source: Enter your phone number
ru: Введите номер телефона

# pleaseEnterPhoneNumber
source: Please enter your phone number
ru: Пожалуйста, введите номер телефона

# phoneNumberMinDigits
source: Phone number must contain at least 10 digits
ru: Номер телефона должен содержать не менее 10 цифр

source: Password
ru: Пароль

# enterPassword
source: Enter your password
ru: Введите пароль

# passwordMinLength
source: At least 8 characters
ru: Не менее 8 символов

# pleaseEnterPassword
source: Please enter your password
ru: Пожалуйста, введите пароль

# passwordMinCharacters
source: Password must be at least 8 characters
ru: Пароль должен содержать не менее 8 символов

source: Confirm Password
ru: Подтвердите пароль

# reenterPassword
source: Re-enter your password
ru: Повторите пароль

# pleaseConfirmPassword
source: Please confirm your password
ru: Пожалуйста, подтвердите пароль

source: Passwords do not match
ru: Пароли не совпадают

source: Sign In
ru: Войти

source: Sign Up
ru: Зарегистрироваться

# dontHaveAccount
source: Don't have an account?
ru: Нет аккаунта?

source: Create Account
ru: Создать аккаунт

source: Sign up to get started
ru: Зарегистрируйтесь, чтобы начать

source: Waiting for Opponent
ru: Ожидание соперника

source: Connecting...
ru: Подключение...

source: Room Code
ru: Код комнаты

source: Connecting to room...
ru: Подключение к комнате...

source: Please wait
ru: Пожалуйста, подождите

# waitingForOpponentMessage
source: Waiting for opponent...
ru: Ожидание соперника...

# searchingForOpponent
source: We are searching for an opponent for you...
ru: Мы ищем для вас соперника...

# failedToConnect
source: Failed to connect: {error}
ru: Не удалось подключиться: {error}

source: Season 4: Shadow Gambit
ru: Сезон 4: Теневой Гамбит

source: LIVE NOW
ru: В ЭФИРЕ

source: Grand Prix 2024
ru: Гран-при 2024

# grandPrixDescription
source: The ultimate rapid chess showdown. Watch grandmasters battle for the throne.
ru: Главное рапид-шоу. Смотрите, как гроссмейстеры сражаются за трон.

source: Watch Stream
ru: Смотреть трансляцию

source: Details
ru: Подробности

source: All Events
ru: Все события

source: Challenges
ru: Вызовы

source: Community
ru: Сообщество

source: Weekly Blitz
ru: Еженедельный блиц

# startsIn
source: Starts in {time}
ru: Начинается через {time}

# blitzArena
source: {time} Blitz Arena
ru: Блиц-арена {time}

# prize
source: {amount} Prize
ru: Приз {amount}

source: Registration Open
ru: Регистрация открыта

source: DAILY CHALLENGE
ru: ЕЖЕДНЕВНЫЙ ВЫЗОВ

source: Mate in 3 Puzzle
ru: Мат в 3 хода

# solvePuzzleDescription
source: Solve today's hardest puzzle to earn points.
ru: Решите самую сложную головоломку дня, чтобы заработать очки.

source: Club Wars
ru: Войны клубов

# teamVsTeam
source: Team vs Team • Starts in {days} days
ru: Команда против команды • Начинается через {days} дней

source: Join
ru: Присоединиться

source: Top Standings
ru: Топ рейтинга

source: View All
ru: Посмотреть все

source: No standings available
ru: Рейтинг недоступен

source: Failed to load standings
ru: Не удалось загрузить рейтинг

source: Player
ru: Игрок

# competeAndClimb
source: Compete and climb the rankings
ru: Соревнуйтесь и поднимайтесь в рейтинге

source: All Modes
ru: Все режимы

source: Classical
ru: Классический

source: All Status
ru: Все статусы

source: In Progress
ru: В процессе

source: Finished
ru: Завершено

source: No tournaments found
ru: Турниры не найдены

# createNewTournament
source: Create a new tournament to get started
ru: Создайте новый турнир, чтобы начать

# failedToLoadTournaments
source: Failed to load tournaments: {error}
ru: Не удалось загрузить турниры: {error}

source: Single Elim
ru: Олимпийская система

source: Double Elim
ru: Двойная олимпийская

source: Swiss
ru: Швейцарская

source: Round Robin
ru: Круговая

source: Registration ended
ru: Регистрация завершена

# startsInDays
source: Starts in {days} day{plural}
ru: Начинается через {days} день{plural}

# startsInHours
source: Starts in {hours} hour{plural}
ru: Начинается через {hours} час{plural}

# startsInMinutes
source: Starts in {minutes} minute{plural}
ru: Начинается через {minutes} минут{plural}

# endsInDays
source: Ends in {days} day{plural}
ru: Заканчивается через {days} день{plural}

# endsInHours
source: Ends in {hours} hour{plural}
ru: Заканчивается через {hours} час{plural}

# endsInMinutes
source: Ends in {minutes} minute{plural}
ru: Заканчивается через {minutes} минут{plural}

source: soon
ru: скоро

source: Cancelled
ru: Отменено

source: PLAYER PROFILE
ru: ПРОФИЛЬ ИГРОКА

source: Error loading profile
ru: Ошибка загрузки профиля

source: Win Rate
ru: Процент побед

source: Streak
ru: Серия

# best
source: Best: {value}
ru: Лучший: {value}

# games
source: {count} Games
ru: {count} игр

source: Performance
ru: Производительность

source: Weekly
ru: Неделя

source: Monthly
ru: Месяц

# noPerformanceData
source: No performance data for {period} period
ru: Нет данных о производительности за {period} период

source: No performance data yet
ru: Пока нет данных о производительности

# errorLoadingPerformance
source: Error loading performance data
ru: Ошибка загрузки данных о производительности

source: Achievements
ru: Достижения

# grandmasterAchievement
source: Grandmaster
ru: Гроссмейстер

source: Reach 2500 MMR
ru: Достичь 2500 MMR

source: On Fire
ru: В огне

# winStreak10
source: 10 Win Streak
ru: Серия из 10 побед

source: Puzzle Master
ru: Мастер головоломок

source: Solve 1000 Puzzles
ru: Решить 1000 головоломок

source: Showcase
ru: Витрина

source: Void Spirit Knight
ru: Рыцарь Духа Пустоты

source: Legendary Skin
ru: Легендарный скин

source: Nebula Queen
ru: Королева Туманности

source: Epic Skin
ru: Эпический скин

source: Enter name
ru: Введите имя

source: Name cannot be empty
ru: Имя не может быть пустым

source: Profile name updated
ru: Имя профиля обновлено

source: Failed to update profile name
ru: Не удалось обновить имя профиля

source: Add Friends
ru: Добавить друзей

source: Search for friends
ru: Искать друзей

# enterAtLeast3Characters
source: Enter at least 3 characters to search for users
ru: Введите не менее 3 символов для поиска пользователей

source: Error searching users
ru: Ошибка поиска пользователей

source: Try again
ru: Попробовать снова

source: Already friends
ru: Уже друзья

source: Request pending
ru: Запрос ожидает

source: Not friends
ru: Не друзья

source: Friend request sent
ru: Запрос на дружбу отправлен

# failedToSendRequest
source: Failed to send request: {error}
ru: Не удалось отправить запрос: {error}

# searchByPhoneOrId
source: Search by phone number or user ID (min 3 characters)...
ru: Поиск по номеру телефона или ID пользователя (минимум 3 символа)...

source: Search Users
ru: Поиск пользователей

source: My Friends
ru: Мои друзья

source: REQUESTS
ru: ЗАПРОСЫ

# pending
source: {count} Pending
ru: {count} Ожидает

# sentYouARequest
source: Sent you a request • {timeAgo}
ru: Отправил вам запрос • {timeAgo}

source: Friend request accepted
ru: Запрос на дружбу принят

# failedToAcceptRequest
source: Failed to accept request: {error}
ru: Не удалось принять запрос: {error}

source: Friend request declined
ru: Запрос на дружбу отклонен

# failedToDeclineRequest
source: Failed to decline request: {error}
ru: Не удалось отклонить запрос: {error}

source: No friends yet
ru: Пока нет друзей

# addFriendsToChallenge
source: Add friends to challenge them to games
ru: Добавьте друзей, чтобы бросить им вызов

source: Error loading friends
ru: Ошибка загрузки друзей

source: Retry
ru: Повторить

source: Offline
ru: Офлайн

source: In Game
ru: В игре

# onlineFriends
source: ONLINE
ru: ОНЛАЙН

# offlineFriends
source: OFFLINE
ru: ОФЛАЙН

source: No users found
ru: Пользователи не найдены

# tryDifferentQuery
source: Try searching with a different query. Make sure to enter at least 3 characters.
ru: Попробуйте другой запрос. Убедитесь, что введено не менее 3 символов.

source: DISCOVER USERS
ru: ОТКРЫТЬ ПОЛЬЗОВАТЕЛЕЙ

# users
source: {count} users
ru: {count} пользователей

source: No users available
ru: Пользователи недоступны

# trySearchingForUsers
source: Try searching for specific users
ru: Попробуйте поискать конкретных пользователей

source: Error loading users
ru: Ошибка загрузки пользователей

source: Enter phone number or user ID
ru: Введите номер телефона или ID пользователя

source: Rating Overview
ru: Обзор рейтинга

source: Error loading rating
ru: Ошибка загрузки рейтинга

source: Go Back
ru: Назад

source: Current Level
ru: Текущий уровень

source: History
ru: История

source: Mode Breakdown
ru: Разбивка по режимам

source: Standard Chess
ru: Стандартные шахматы

source: Rock Paper Scissors
ru: Камень, ножницы, бумага

source: Pieces
ru: Фигуры

source: Boards
ru: Доски

source: Avatars
ru: Аватары

source: Effects
ru: Эффекты

# availablePieceSets
source: Available Piece Sets ({count})
ru: Доступные наборы фигур ({count})

# selected
source: Selected: {name}
ru: Выбрано: {name}

source: Select
ru: Выбрать

# availableAvatars
source: Available Avatars (20)
ru: Доступные аватары (20)

# availableBoardThemes
source: Available Board Themes ({count})
ru: Доступные темы доски ({count})

# availableEffects
source: Available Effects ({count})
ru: Доступные эффекты ({count})

source: Selected: Classic
ru: Выбрано: Классика

# myPieces
source: My {category}
ru: Мои {category}

source: Sort by: Rarity
ru: Сортировать по: Редкость

source: Equipped
ru: Надета

# unlockAtLevel
source: Unlock at Lvl {level}
ru: Разблокировать на уровне {level}

# equippedItem
source: {name} equipped!
ru: {name} надета!

# failedToEquip
source: Failed to equip: {error}
ru: Не удалось надеть: {error}

source: Customize
ru: Настроить

source: Get More
ru: Получить больше

source: Visit the Shop
ru: Посетить магазин

source: Error loading collection
ru: Ошибка загрузки коллекции

source: Error loading items
ru: Ошибка загрузки предметов

# selectedAndSaved
source: {name} selected and saved
ru: {name} выбрано и сохранено

# failedToSelect
source: Failed to select {item}: {error}
ru: Не удалось выбрать {item}: {error}

source: Currently Selected
ru: В настоящее время выбрано

source: Select This Effect
ru: Выбрать этот эффект

source: Select This Theme
ru: Выбрать эту тему

source: Light
ru: Светлая

source: Dark
ru: Темная

# levelsAndTitles
source: Levels & Titles
ru: Уровни и звания

source: Failed to load levels
ru: Не удалось загрузить уровни

source: All Levels
ru: Все уровни

source: CURRENT
ru: ТЕКУЩИЙ

# xpToUnlock
source: {xp} XP to unlock
ru: {xp} ОП для разблокировки

source: Global Lobby
ru: Глобальный лобби

source: Clan
ru: Клан

source: Mentions
ru: Упоминания

source: Today
ru: Сегодня

# welcomeToGlobalStrategy
source: Welcome to the Global Strategy Channel
ru: Добро пожаловать в Глобальный стратегический канал

source: You
ru: Вы

source: Replying to you
ru: Ответ на ваше сообщение

source: Type a message...
ru: Введите сообщение...

source: Leaderboard
ru: Таблица лидеров

# noLeaderboardData
source: No leaderboard data available
ru: Нет данных таблицы лидеров

source: Error loading leaderboard
ru: Ошибка загрузки таблицы лидеров
